# HeadingOrientation Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleField..::..HeadingOrientation Property
ScheduleField Class See Also
---
The orientation of the column heading text.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ScheduleHeadingOrientation HeadingOrientation { get; set; }
```

Visual Basic
---
```text
Public Property HeadingOrientation As ScheduleHeadingOrientation
	Get
	Set
```

Visual C++
---
```text
public:
property ScheduleHeadingOrientation HeadingOrientation {
	ScheduleHeadingOrientation get ();
	void set (ScheduleHeadingOrientation value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
ScheduleField Class
Autodesk.Revit.DB Namespace